# [ 과제 ]
# 3가지 원 핫 인코딩 방식을 비교할것 
# 원 핫 인코딩( One Hot Encoding ) 단어 집합의 크기를 벡터 차원으로 만든 뒤,
# 표현하고 싶은 단어의 인덱스에 1의 값을 부여하고 다른 인덱스에는 0을
# 부여하는 방식을 말합니다. 

# 원핫(One-Hot) 인코딩이라는 말처럼 이 기술은 데이터를 수많은 0과 한개의 1의 값으로 데이터를 구별하는 인코딩이다.
# 예를 들어, 글자가 적힌 종이를 0부터 9까지의 숫자값으로 분류를 하는 작업을 한다면 숫자값들은 다음과 같은 값들로 이루어질 수 있을 것이다.



#1. pandas의 get_dummies 

#2. tensorflow의 to_categorical

#3. sklearn의 OneHotEncoder 

# 미세한 차이를 정리하시오 

# to categorical 은 0부터 시작하기때문에 0을 만들어버림 그래서 8개가 됨 
# 1번 3번은 0부터 시작하지 않기때문에 15_4번 에 쓰기좋다 
# 하지만 2번도 못쓰일만한 것은 아니다 



# 수치화 데이터는 회귀 
# 문자열 혹은 데이터는 분류 
