import tensorflow as tf

print("텐서플로 버전 :", tf.__version__)


num = [1,2,3,4,5]
print(num)

food = ['치킨', '삼겹살', '라면', '돈까스']
print(food)

emlist = [1,'한글', [ 789]]
print(emlist)



#  파이썬 - 리스트 조사 ( list ) 과제    ,    
#  코디도장 학원배부 책 
# date 2개 이상은 리스트 (list)
# 행렬 구별하는법? 예제 몇개 해서 같이 보내기 ( 17번 )



# li[]
# li=list[]




# 데이터 분석은  y 데이터가 1개가 많다 2개부터는 드물다 x는 많다 \

# 사이킷런 ** 텐서플로우를 하더라도 사이킷런을 섞어 쓴다 
# 첫번째 모델에 들어간 데이터 
# 두번째 모델에 들어간 데이터
# 개발자들 사이에서 네이밍 룰이 있다 - 파이썬을 할때에는 언더바로 한다 train_test_split
# 자바의경우 파일 이름을 대문자로 한다 TrainTestSplit    카멜페이스 


# 열 피쳐 컬럼 특성
# 행 무시 열 우선 무조건 열이 우선 
# 파이썬 줄간격 동일 한칸이 띄어지거나 두칸이 띄어지면 윗칸의 부수적내용이 됨  예외는 가로 

# 국민취업제도 신청 
# 1주일 ~ 1주일 조금 
# 상담 3번 최소의 간격 3일 ( 대면 ) 










# one hot encoding 
# tensorflow , keras 2개의 방법이 있따 ( 따로 공부할것 )
